package twix.quest.quest;

/** Тип цели квеста: что отслеживаем. */
public enum QuestType {

    /** Добыча N определённого материала/блока. */
    MINE_BLOCK,

    /** Скрафтить предмет определённого типа. */
    CRAFT_ITEM,

    /** Получить через крафт/выдачу определённый предмет. */
    RECEIVE_ITEM,

    /** Убийство N определённого типа сущности. */
    KILL_MOB,

    /** Убийство N игроков. */
    KILL_PLAYER,

    /** Зайти в заданный мир (по environment или world name). */
    ENTER_WORLD,

    /** Побывать в пределах N блоков от структуры. */
    VISIT_STRUCTURE,

    /** Поторговаться с жителем (любое завершение сделки). */
    TRADE_VILLAGER,

    /** Сдать в специальное хранилище/беременный байер (детектируем вручную). */
    SELL_TO_BUYER,

    /** Иметь на счету минимальный баланс. */
    REACH_BALANCE,

    /** Сдать N предмета (в квестовый контейнер инвентаря). */
    DEPOSIT_ITEM,

    /** Оседлать лавомерку (STRIDER) в Нижнем мире. */
    MOUNT_STRIDER
}
